## 第五章 pandas入门

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4,2,1,-2,3.])
obj

0    4.0
1    2.0
2    1.0
3   -2.0
4    3.0
dtype: float64

In [4]:
obj.values
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj2 = pd.Series([3,2,4,4,],index=['a','v','e','t'],dtype='int')
obj2

a    3
v    2
e    4
t    4
dtype: int64

In [6]:
obj2[:'v']

a    3
v    2
dtype: int64

In [7]:
obj2[obj2>2]

a    3
e    4
t    4
dtype: int64

In [8]:
np.exp(obj2)

a    20.085537
v     7.389056
e    54.598150
t    54.598150
dtype: float64

In [9]:
'a' in obj2.index

True

In [10]:
pd.isnull(obj2)

a    False
v    False
e    False
t    False
dtype: bool

In [11]:
data = {'name' : ['aaa','bbb','ccc','ddd'],'age' : [22,33,12,32],'gender' : ['male','famel','famel','male']}
frame = pd.DataFrame(data)
frame.head()

   age gender name
0   22   male  aaa
1   33  famel  bbb
2   12  famel  ccc
3   32   male  ddd

In [12]:
frame.name

0    aaa
1    bbb
2    ccc
3    ddd
Name: name, dtype: object

In [13]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [14]:
pd.DataFrame(pd.DataFrame(data).T,index = ['name','gender','mm'])

           0      1      2     3
name     aaa    bbb    ccc   ddd
gender  male  famel  famel  male
mm       NaN    NaN    NaN   NaN

In [15]:
import pandas as pd
import numpy as np
obj3 = pd.Series(['yellow','pink','green'])
obj3

0    yellow
1      pink
2     green
dtype: object

In [16]:
obj3.reindex(range(7),method='ffill')

0    yellow
1      pink
2     green
3     green
4     green
5     green
6     green
dtype: object

In [17]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ohi','china','US'])
frame

   ohi  china  US
a    0      1   2
b    3      4   5
c    6      7   8

In [18]:
frame2 = frame.reindex(['b','a','c','d'])
frame2

   ohi  china   US
b  3.0    4.0  5.0
a  0.0    1.0  2.0
c  6.0    7.0  8.0
d  NaN    NaN  NaN

In [19]:
states = ['Texa','India','Korea']
frame.reindex(columns=states)

   Texa  India  Korea
a   NaN    NaN    NaN
b   NaN    NaN    NaN
c   NaN    NaN    NaN

In [20]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [21]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [22]:
new_obj < 2

a     True
b     True
d    False
e    False
dtype: bool

In [23]:
s1 = pd.Series([3.3,.2,3,4],index=['a','b','c','d'])
s2 = pd.Series([-2.,4,2.4,1],index=['a','c','e','f'])
s1 + s2

a    1.3
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
dtype: float64

In [24]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))
df1.add(df2,fill_value=0.)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [25]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [26]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [27]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [28]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [29]:
df.idxmax()

one    b
two    d
dtype: object

In [30]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [31]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000